energia/cc13xx-core/system/source/ti/devices/cc26x0r2/inc/hw_fcfg1.h
// Field:  [15:8] PVH
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_P_R_PV_PVH_W                                             8
#define FCFG1_FLASH_P_R_PV_PVH_M                                    0x0000FF00
#define FCFG1_FLASH_P_R_PV_PVH_S                                             8

// Field:   [7:0] PVH2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_P_R_PV_PVH2_W                                            8
#define FCFG1_FLASH_P_R_PV_PVH2_M                                   0x000000FF
#define FCFG1_FLASH_P_R_PV_PVH2_S                                            0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_EH_SEQ
//
//*****************************************************************************
// Field: [31:24] EH
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_EH_SEQ_EH_W                                              8
#define FCFG1_FLASH_EH_SEQ_EH_M                                     0xFF000000
#define FCFG1_FLASH_EH_SEQ_EH_S                                             24

// Field: [23:16] SEQ
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_EH_SEQ_SEQ_W                                             8
#define FCFG1_FLASH_EH_SEQ_SEQ_M                                    0x00FF0000
#define FCFG1_FLASH_EH_SEQ_SEQ_S                                            16

// Field: [15:12] VSTAT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_EH_SEQ_VSTAT_W                                           4
#define FCFG1_FLASH_EH_SEQ_VSTAT_M                                  0x0000F000
#define FCFG1_FLASH_EH_SEQ_VSTAT_S                                          12

// Field:  [11:0] SM_FREQUENCY
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_W                                   12
#define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_M                           0x00000FFF
#define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_S                                    0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_VHV_E
//
//*****************************************************************************
// Field: [31:16] VHV_E_START
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_E_VHV_E_START_W                                     16
#define FCFG1_FLASH_VHV_E_VHV_E_START_M                             0xFFFF0000
#define FCFG1_FLASH_VHV_E_VHV_E_START_S                                     16

// Field:  [15:0] VHV_E_STEP_HIGHT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_W                                16
#define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_M                        0x0000FFFF
#define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_PP
//
//*****************************************************************************
// Field: [31:24] PUMP_SU
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_PP_PUMP_SU_W                                             8
#define FCFG1_FLASH_PP_PUMP_SU_M                                    0xFF000000
#define FCFG1_FLASH_PP_PUMP_SU_S                                            24

// Field:  [15:0] MAX_PP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_PP_MAX_PP_W                                             16
#define FCFG1_FLASH_PP_MAX_PP_M                                     0x0000FFFF
#define FCFG1_FLASH_PP_MAX_PP_S                                              0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_PROG_EP
//
//*****************************************************************************
// Field: [31:16] MAX_EP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_PROG_EP_MAX_EP_W                                        16
#define FCFG1_FLASH_PROG_EP_MAX_EP_M                                0xFFFF0000
#define FCFG1_FLASH_PROG_EP_MAX_EP_S                                        16

// Field:  [15:0] PROGRAM_PW
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_PROG_EP_PROGRAM_PW_W                                    16
#define FCFG1_FLASH_PROG_EP_PROGRAM_PW_M                            0x0000FFFF
#define FCFG1_FLASH_PROG_EP_PROGRAM_PW_S                                     0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_ERA_PW
//
//*****************************************************************************
// Field:  [31:0] ERASE_PW
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_ERA_PW_ERASE_PW_W                                       32
#define FCFG1_FLASH_ERA_PW_ERASE_PW_M                               0xFFFFFFFF
#define FCFG1_FLASH_ERA_PW_ERASE_PW_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_VHV
//
//*****************************************************************************
// Field: [27:24] TRIM13_P
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_TRIM13_P_W                                           4
#define FCFG1_FLASH_VHV_TRIM13_P_M                                  0x0F000000
#define FCFG1_FLASH_VHV_TRIM13_P_S                                          24

// Field: [19:16] VHV_P
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_VHV_P_W                                              4
#define FCFG1_FLASH_VHV_VHV_P_M                                     0x000F0000
#define FCFG1_FLASH_VHV_VHV_P_S                                             16

// Field:  [11:8] TRIM13_E
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_TRIM13_E_W                                           4
#define FCFG1_FLASH_VHV_TRIM13_E_M                                  0x00000F00
#define FCFG1_FLASH_VHV_TRIM13_E_S                                           8

// Field:   [3:0] VHV_E
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_VHV_E_W                                              4
#define FCFG1_FLASH_VHV_VHV_E_M                                     0x0000000F
#define FCFG1_FLASH_VHV_VHV_E_S                                              0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_VHV_PV
//
//*****************************************************************************
// Field: [27:24] TRIM13_PV
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_W                                       4
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_M                              0x0F000000
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_S                                      24

